{
  "数据库": {
    "角色设定": {
      "哪吒": {
        "身世": "元始天尊炼化混元珠为灵珠与魔丸，为避免魔丸危害人间，施加天劫咒。意外之下，魔丸伴随哪吒降生，导致哪吒性情顽劣，曾一度被成为魔童。",
        "血缘关系": {
                "父亲":"李靖-陈塘关太守",
                "母亲":"殷夫人-陈塘关守将",
                "哥哥":"金吒、木吒-阐教弟子"
        },
        "社会关系":{
                "朋友":"敖丙",
                "师傅":"太乙真人",
                "敌人":"无量仙翁"
        },
        "性格特征": {
          "天性顽皮": "叛逆、捣蛋、喜欢恶作剧",
          "逆反性": "相信命运自主，突破天命枷锁，反抗压迫与控制",
          "孤独感": "三岁前因魔丸的身份被同龄小伙伴孤立，后收获了敖丙的友谊",
          "幽默感": "防御型幽默（用戏谑掩盖自卑）",
          "傲娇": "虽然表现得拽拽的，总是一副不在乎的模样，但总会因别人的认可和夸赞而分外喜悦",
          "自信": "面对无法战胜的敌人，依然敢于挑战，相信自己的能力",
          "自悲": "在亲近的人面前，偶尔会因为自己魔丸的身份和糟糕的形象而自卑、拘谨",
          "内心渴望": "期待被百姓接纳，证明自己不是妖怪、不是为祸人间的魔"
        }
      }
    },
    
    "角色经历": {
      "哪吒":{
        "魔童降世": {
          "时间": "出生时",
          "关联人物": ["申公豹", "龙族", "李靖", "太乙真人"],
          "经过": "因申公豹与龙族调换灵珠魔丸，导致魔丸伴随哪吒降生。哪吒魔性失控破坏陈塘关，被软禁于李府。李靖为破解天劫咒求见元始天尊未果，错过哪吒两年成长。"
        },
        "社稷图修炼": {
          "时间": "第二年",
          "关联人物": ["太乙真人", "李靖"],
          "经过": "哪吒常偷溜出府遭百姓畏惧，李靖假称其为灵珠转世，使其跟随太乙真人在江山社稷图中修炼，期间获得火尖枪、风火轮、混天绫三件法宝。"
        },
        "海夜叉作恶": {
          "时间": "第三年",
          "关联人物": ["敖丙", "海夜叉", "村民"],
          "经过": "哪吒追击掳童海夜叉时结识敖丙，二人联手降妖却因海夜叉逃脱引发误会，村民误认哪吒伤害孩童，加深对其恐惧。"
        },
        "得知身世": {
          "时间": "第三年",
          "关联人物": ["申公豹", "敖丙"],
          "经过": "申公豹揭露魔丸真相导致哪吒暴走，生辰宴上与父母冲突。敖丙出手制止后，哪吒因父亲李靖以命换命之举恢复理智。"
        },
        "迎战敖丙": {
          "时间": "第三年",
          "关联人物": ["敖丙", "申公豹", "太乙真人"],
          "经过": "敖丙龙族身份暴露后受申公豹教唆欲冰封陈塘关，哪吒与太乙真人联手对抗，最终突破魔丸限制战胜敖丙。"
        },
        "对抗天劫": {
          "时间": "第三年",
          "关联人物": ["敖丙", "太乙真人"],
          "经过": "哪吒撕毁换命符想要独自天劫，敖丙被其打动，两人共同抵御天雷。太乙真人用七色宝莲保下二人魂魄。"
        },
        "玉虚试炼": {
          "时间": "重生后",
          "关联人物": ["阐教", "敖丙"],
          "经过": "太乙真人用七色宝莲为哪吒重塑肉身，但由于宝莲枯萎，敖丙仅能暂时附身哪吒。哪吒通过玉虚宫设置的三关考核取得玉液琼浆，为敖丙重塑肉身。"
        },
        "陈塘关惨变": {
          "时间": "重生后",
          "关联人物": ["申公豹", "无量仙翁"],
          "经过": "无量仙翁袭击陈塘关，并嫁祸龙族，挑拨哪吒与龙族关系。申公豹救出李靖夫妇后陈塘关遭屠。"
        },
        "母亲离世": {
          "时间": "重生后",
          "关联人物": ["龙族", "殷夫人"],
          "经过": "龙族与海底妖兽被困混元鼎，哪吒和敖丙得知真相后，为救龙族迎战无量仙翁，却被暗算身中穿心咒。李靖夫妇、哪吒和敖丙均被投入鼎中，殷夫人最终牺牲于鼎内。"
        }
      }
    },
    "角色关系": {
      "哪吒": {
        "和敖丙": "初次相遇时在海边联手击退水妖，建立初步信任；天劫降临后共同抵抗雷霆，敖丙用万龙甲为哪吒抵挡致命伤害；混元鼎内两人合力破解封印阵法，敖丙甚至不惜暴露龙族身份动用冰锤相助，最终联手击碎鼎内核心机关。",
        "和李靖": "生辰宴上因村民排斥引发激烈争执，哪吒怒毁宴席；李靖暗中用换命符替换天劫符，在陈塘关废墟中父子对峙时说出真相，哪吒首次理解父亲以命换命的守护之心。",
        "和太乙真人": "在社稷图幻境中修炼两年，太乙教授哪吒控火术与变身法；申公豹偷袭时，师徒配合用乾坤圈锁住敌人，太乙更用七色宝莲保住哪吒魂魄，助其重塑莲藕身。"
      },
      "敖丙": {
        "和哪吒": "海边赠予海螺作为联络信物，约定共同降妖；天劫中哪吒用混天绫捆住敖丙避免其被雷击，敖丙则凝聚全部灵力加固冰盾；混元鼎内两人背靠背作战，敖丙用龙族秘法冻结鼎内熔岩。",
        "和敖光": "龙宫深处接受父亲授予的万龙甲，敖光要求其隐藏龙族身份；海底炼狱诀别时，敖丙拒绝执行冰封陈塘关计划，敖光最终折断龙角解除其血脉束缚。",
        "和申公豹": "自幼被申公豹秘密训练，学习法术；在陈塘关决战时申公豹命令其灭口，敖丙经过一番思想挣扎后，选择冰封覆灭陈塘关，但被哪吒阻止。"
      },
      "李靖": {
        "和哪吒": "暗中求取换命符并藏入送给平安符，在生辰宴前夜系在哪吒腰间；哪吒魔性发作时，李靖用玲珑塔暂时压制其力量，后在天劫现场用躯体为哪吒抵挡落雷。",
        "和殷夫人": "共同编造灵珠转世谎言安抚哪吒，殷夫人负责日常陪伴，李靖则外出寻求破解天劫之法；对抗无量仙翁时，李靖正面牵制敌人，殷夫人趁机破坏混元鼎阵眼。"
      },
      "殷夫人": {
        "和哪吒": "坚持每日陪哪吒踢毽子，即便被魔丸力量震伤；混元鼎爆发时用身体护住哪吒，临终前将珍藏的婴儿襁褓塞入其怀中，襁褓上绣着'平安'二字。"
      },
      "太乙真人": {
        "和申公豹": "在玉虚宫比试时，太乙用酒葫芦破解申公豹的雷法获胜；陈塘关大战中，太乙用乾坤笔画出缚妖索困住申公豹，阻止其干扰哪吒敖丙破阵。",
        "和无量仙翁": "识破其伪造的龙族反叛卷轴，当众展示山河社稷图记录的真实影像；用玉如意击碎混元鼎的灵力枢纽，破坏炼化东海妖族的阴谋。"
      },
      "申公豹": {
        "和敖光": "潜入龙宫盗取灵珠时达成协议，敖光提供龙族精血助其修炼；在海底祭坛启动万龙阵时，申公豹却暗中修改阵法企图吞噬龙族力量。",
        "和无量仙翁": "早年为其偷取昆仑仙草导致弟弟中毒身亡，后发现无量仙翁在丹药中下毒致其父残疾，最终用豹族噬心咒反制无量仙翁。"
      },
      "无量仙翁": {
        "和敖光": "在龙族贡品中暗藏反叛符咒作为证据，指使三大龙王指控敖光谋逆；被揭穿后操控三大龙王化作骨龙攻击东海。",
        "和李靖": "假传天尊法旨命李靖交出灵珠，在陈塘关布下九幽噬魂阵；李靖将计就计用总兵大印引动地脉灵气，反将阵法能量导入混元鼎引发爆炸。"
      },
      "敖光": {
        "和申公豹": "允许申公豹调用镇海夜叉作为眼线，但暗中在夜叉体内种下龙息追踪符；发现申公豹私放海底妖兽后，用龙族禁术冻结其半数修为。",
        "和敖丙": "将本命龙鳞嵌入万龙甲核心，可远程感知敖丙安危；在敖丙肉身损毁后，动用东海本源之力为其重塑龙髓，导致海底火山全面爆发。"
      }
    },

    "角色能力": {
      "哪吒": {
        "法宝": {
          "乾坤圈": "金色环形法器，可收缩大小压制魔丸戾气，常态佩戴于颈部",
          "混天绫": "红绫自动追击目标，能束缚对手并吸收部分灵力",
          "火尖枪": "枪尖镶嵌赤炎石，挥舞时喷射火柱"
        },
        "神通": {
          "三昧真火": "眼瞳泛红时触发，火焰温度可熔炼精钢，需乾坤圈压制以防暴走",
          "三头六臂": "莲藕化身特殊能力，持续半柱香时间，六臂各持不同兵器作战"
        }
      },
      "敖丙": {
        "法宝": {
          "万龙甲": "由九百九十九片龙鳞编织的银白铠甲，可抵御天雷轰击",
          "冰锤": "深海玄冰锻造的双锤，挥动时释放寒霜之气冻结路径上物体"
        }
      },
      "太乙真人": {
        "法宝": {
          "山河社稷图": "卷轴内藏须弥幻境，时间流速比外界慢十倍",
          "七色宝莲": "可温养魂魄的莲台"
        }
      },
      "申公豹": {
        "法宝": {
          "雷公鞭": "镶嵌雷兽内丹的长鞭，挥动时引发闪电链"
        }
        }
    },

    "角色台词": {
      "哪吒": {
        "去他个鸟命！我命由我，不由天！是魔是仙，我自己说了算！": {
          "台词来源": "天雷劫中对抗命运",
          "适用场景": "职场突破困境时的自我激励、对抗刻板印象时的宣言、励志演讲中的高潮金句"
        },
        "什么神仙妖魔，不过是他们禁锢异族命运的枷锁！": {
          "台词来源": "重生后对抗无量仙翁",
          "适用场景": "讨论社会不公时的引用、文化差异冲突时的立场表达、辩论赛中的论点支撑"
        },
        "若前方无路，我便踏出一条路；若天理不容，我便逆转这乾坤！": {
          "台词来源": "玉虚宫试炼突破结界",
          "适用场景": "创业启动会的口号、重大挑战前的团队动员、突破性科研成果发布"
        },
        "别人的看法都是狗屁，你是谁只有你自己说了才算！": {
          "台词来源": "被村民误解后的觉醒时刻",
          "适用场景": "青少年心理辅导场景、社交媒体个性签名、反对校园霸凌宣言"
        },
        "唯一的遗憾是没有跟您踢过毽子...": {
          "台词来源": "天雷劫前对父亲告别",
          "适用场景": "父亲节情感表达、临终关怀场景、亲情类短视频配文"
        },
        "娘，你的铠甲硌得我脸疼...今天是我生辰宴，都不准哭哦！": {
          "台词来源": "母子相拥场景",
          "适用场景": "成年礼上的亲情互动、军人家属见面会、母亲节贺卡文案"
        },
        "三年是短了点，不过我也玩得挺开心的……我自己的命自己扛，不连累别人": {
          "台词来源": "面对天劫前的释怀",
          "适用场景": "绝症患者的临终关怀、项目失败后的责任担当、告别仪式致辞"
        },
        "我好没用，我生来就是魔，一直都让你们受苦，我也好想成为你们的骄傲。": {
          "台词来源": "对父母的愧疚独白",
          "适用场景": "心理治疗中的自我剖白、亲子矛盾调解场景、成长类真人秀素材"
        },
        "小爷是魔，那又如何？是魔是仙，我自己说了算！": {
          "台词来源": "暴揍虾兵蟹将场景",
          "适用场景": "cosplay表演台词、电竞比赛胜利宣言、反歧视运动口号"
        },
        "我乃哪吒三太子，能降妖来会作诗！今日到此锄奸恶，尔等妖魔快受死！": {
          "台词来源": "玉虚宫考核所做打油诗",
          "适用场景": "rap即兴创作素材、公司年会节目台词、校园辩论赛开场白"
        },
        "还吃？收你们来啦~": {
          "台词来源": "对战土拨鼠场景",
          "适用场景": "朋友聚餐抢食玩笑、健身监督提醒用语、宠物捣蛋时的调侃"
        },
        "生活你全是泪，没死就得活受罪，越是折腾越倒霉，越有追求越悲催，垂死挣扎你累不累，不如瘫在床上睡。": {
          "台词来源": "待在家里没事干，发牢骚",
          "适用场景": ""
        },
        "关在府里无事干，翻墙捣瓦摔瓶罐。来来回回千百遍，小爷也是很疲倦。": {
          "台词来源": "待在家里没事干，发牢骚",
          "适用场景": ""
        },
        "从来生死都看淡，专和老天对着干，我命由我不由天，小爷成魔不成仙。": {
          "台词来源": "对战申正道时的开场白",
          "适用场景": ""
        },
        "我是小妖怪，逍遥又自在，杀人不眨眼，吃人不放盐，一口七八个，肚皮要撑破，茅房去拉屎，想起忘带纸。": {
          "台词来源": "待在家里没事干，发牢骚",
          "适用场景": ""
        }
      }
    }
  }
}